In [4]:
import pandas as pd

In [12]:
dict1 = {"Name":["Priyanka","yogesh","Krishna","Vedant","Parshv",
                "Mittal","Arvhana"],
        "Marks":[88,99,98,79,88,23,99],
        "Gender":["Male","Female","Female","Male","Female","Female","Male"]}
df1 = pd.DataFrame(dict1)
df1

       Name  Marks  Gender
0  Priyanka     88    Male
1    yogesh     99  Female
2   Krishna     98  Female
3    Vedant     79    Male
4    Parshv     88  Female
5    Mittal     23  Female
6   Arvhana     99    Male

In [14]:
df1.head(3)

       Name  Marks  Gender
0  Priyanka     88    Male
1    yogesh     99  Female
2   Krishna     98  Female

In [16]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     88  Female
5   Mittal     23  Female
6  Arvhana     99    Male

In [22]:
 # attibute
df1.shape

(7, 3)

In [24]:
print("Number of Row: ",df1.shape[0])
print("Number of column: ",df1.shape[1])

Number of Row:  7
Number of column:  3

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [31]:
#isnull- check null value true and false
#sum - count of null value
#axis=1 => check row by axix=0 check column
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [34]:
#describe = overall statistics about dataframe -> count , mean, std, min....
#include=all
df1.describe(include='all')

            Name      Marks  Gender
count          7   7.000000       7
unique         7        NaN       2
top     Priyanka        NaN  Female
freq           1        NaN       4
mean         NaN  82.000000     NaN
std          NaN  27.067816     NaN
min          NaN  23.000000     NaN
25%          NaN  83.500000     NaN
50%          NaN  88.000000     NaN
75%          NaN  98.500000     NaN
max          NaN  99.000000     NaN

In [36]:
df1

       Name  Marks  Gender
0  Priyanka     88    Male
1    yogesh     99  Female
2   Krishna     98  Female
3    Vedant     79    Male
4    Parshv     88  Female
5    Mittal     23  Female
6   Arvhana     99    Male

In [38]:
#unique vlaue in gender
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [40]:
#find the number of unique values frome the gender column
df1["Gender"].nunique()

2

In [43]:
#count unique value
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [46]:
#total number of student 90 to 1000
df1[df1["Marks"]>=90]

      Name  Marks  Gender
1   yogesh     99  Female
2  Krishna     98  Female
6  Arvhana     99    Male

In [57]:
#df1[(df1['Marks']>=90) & (df1["Marks"]<=100)]
#count number of student 90 to 100
len(df1[(df1['Marks']>=90) & (df1["Marks"]<=100)])

3

In [64]:
#using between method
#df1['Marks'].between(90,100)
sum(df1['Marks'].between(90,100))

3

In [65]:
#in-built method => mean, min, max 
df1['Marks'].mean()

np.float64(82.0)

In [66]:
#Apply method
def marks(x):
    return x/2

In [69]:
df1["Marks"].apply(marks)

0    44.0
1    49.5
2    49.0
3    39.5
4    44.0
5    11.5
6    49.5
Name: Marks, dtype: float64

In [ ]:
#dd new coloum
df1["Half_Marks"]=df1["Marks"].apply(marks)

In [74]:
df1

       Name  Marks  Gender  Half_Marks
0  Priyanka     88    Male        44.0
1    yogesh     99  Female        49.5
2   Krishna     98  Female        49.0
3    Vedant     79    Male        39.5
4    Parshv     88  Female        44.0
5    Mittal     23  Female        11.5
6   Arvhana     99    Male        49.5

In [ ]:
#Using lambda function
df1['Marks'].apply(lambda x:x/2)

In [80]:
#len method count name str
df1["Name"].apply(len)

0    8
1    6
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

13. Map Fuction

In [82]:
df1

       Name  Marks  Gender  Half_Marks
0  Priyanka     88    Male        44.0
1    yogesh     99  Female        49.5
2   Krishna     98  Female        49.0
3    Vedant     79    Male        39.5
4    Parshv     88  Female        44.0
5    Mittal     23  Female        11.5
6   Arvhana     99    Male        49.5

In [85]:
df1["Gender"].map({"Male":1, "Female":0})

0    1
1    0
2    0
3    1
4    0
5    0
6    1
Name: Gender, dtype: int64

In [87]:
df1["Male_Female"]=df1["Gender"].map({"Male":1, "Female":0})

In [89]:
df1

       Name  Marks  Gender  Half_Marks  Male_Female
0  Priyanka     88    Male        44.0            1
1    yogesh     99  Female        49.5            0
2   Krishna     98  Female        49.0            0
3    Vedant     79    Male        39.5            1
4    Parshv     88  Female        44.0            0
5    Mittal     23  Female        11.5            0
6   Arvhana     99    Male        49.5            1

In [91]:
#DRop
df1.drop("Male_Female",axis=1)

       Name  Marks  Gender  Half_Marks
0  Priyanka     88    Male        44.0
1    yogesh     99  Female        49.5
2   Krishna     98  Female        49.0
3    Vedant     79    Male        39.5
4    Parshv     88  Female        44.0
5    Mittal     23  Female        11.5
6   Arvhana     99    Male        49.5

In [103]:
#multiple column remove
df1.drop(["Male_Female","Half_Marks"],axis=1)

       Name  Marks  Gender
0  Priyanka     88    Male
1    yogesh     99  Female
2   Krishna     98  Female
3    Vedant     79    Male
4    Parshv     88  Female
5    Mittal     23  Female
6   Arvhana     99    Male

In [104]:
df1

       Name  Marks  Gender  Half_Marks  Male_Female
0  Priyanka     88    Male        44.0            1
1    yogesh     99  Female        49.5            0
2   Krishna     98  Female        49.0            0
3    Vedant     79    Male        39.5            1
4    Parshv     88  Female        44.0            0
5    Mittal     23  Female        11.5            0
6   Arvhana     99    Male        49.5            1

In [96]:
#column name
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

In [106]:
#sort the dataframe as per the marks column
df1.sort_values(by="Marks",ascending=False)

       Name  Marks  Gender  Half_Marks  Male_Female
1    yogesh     99  Female        49.5            0
6   Arvhana     99    Male        49.5            1
2   Krishna     98  Female        49.0            0
0  Priyanka     88    Male        44.0            1
4    Parshv     88  Female        44.0            0
3    Vedant     79    Male        39.5            1
5    Mittal     23  Female        11.5            0

In [108]:
df1

       Name  Marks  Gender  Half_Marks  Male_Female
0  Priyanka     88    Male        44.0            1
1    yogesh     99  Female        49.5            0
2   Krishna     98  Female        49.0            0
3    Vedant     79    Male        39.5            1
4    Parshv     88  Female        44.0            0
5    Mittal     23  Female        11.5            0
6   Arvhana     99    Male        49.5            1

In [111]:
#name and marks female studnt
df1[df1["Gender"]=='Female'][['Name',"Marks"]]

      Name  Marks
1   yogesh     99
2  Krishna     98
4   Parshv     88
5   Mittal     23